# Insert

In [125]:
import pandas as pd 
df =pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
df

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [127]:
df.insert(1,"python",df["A"])
df

   A  python  B
0  1       1  5
1  2       2  6
2  3       3  7
3  4       4  8

In [129]:
df.insert(2,"python1",[9,7,6,5])
df

   A  python  python1  B
0  1       1        9  5
1  2       2        7  6
2  3       3        6  7
3  4       4        5  8

In [135]:
df =pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
df
df["python"]=df["A"][:2]
df

   A  B  python
0  1  5     1.0
1  2  6     2.0
2  3  7     NaN
3  4  8     NaN

# Delete

In [149]:
df =pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8],"C":[9,8,7,6]})
df
var1=df.pop("B")
var1

0    5
1    6
2    7
3    8
Name: B, dtype: int64

In [151]:
df

   A  C
0  1  9
1  2  8
2  3  7
3  4  6